; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v1 ?v3)
             (pred_5 ?v4 ?v2)
             (pred_6 ?v1 ?v2)
             (pred_1 ?v8 ?v1 )
	     (pred_8 ?v1)
             (pred_11 ?v11)
             (pred_12 ?v4)
             (pred_9 ?v2)
             (pred_3 ?v1)
             (pred_10 ?v4)
             (pred_4 ?v1)
             (pred_7 ))



(:action op_2
:parameters (?v5 ?v9 ?v6 ?v13)
:precondition (and (pred_11 ?v5) (pred_11 ?v9) (pred_12 ?v6) (pred_9 ?v13)
          (pred_2 ?v5 ?v9) (pred_5 ?v6 ?v13)
                   (pred_6 ?v9 ?v13) (pred_8 ?v5) 
                   (pred_3 ?v9) (pred_10 ?v6))
:effect (and  (pred_4 ?v9) (not (pred_3 ?v9))))


(:action op_5
:parameters (?v5 ?v12)
:precondition (and (pred_11 ?v5) (pred_11 ?v12)
               (pred_8 ?v5) (pred_2 ?v5 ?v12) (pred_4 ?v12))
:effect (and (pred_8 ?v12) (not (pred_8 ?v5))))

(:action op_3
:parameters (?v5 ?v6)
:precondition (and (pred_11 ?v5) (pred_12 ?v6) 
                  (pred_8 ?v5) (pred_1 ?v6 ?v5) (pred_7 ))
:effect (and (pred_10 ?v6)
   (not (pred_1 ?v6 ?v5)) (not (pred_7 ))))


(:action op_1
:parameters (?v5 ?v10 ?v7)
:precondition (and (pred_11 ?v5) (pred_12 ?v10) (pred_12 ?v7)
                  (pred_8 ?v5) (pred_10 ?v7) (pred_1 ?v10 ?v5))
:effect (and (pred_10 ?v10) (pred_1 ?v7 ?v5)
        (not (pred_10 ?v7)) (not (pred_1 ?v10 ?v5))))

(:action op_4
:parameters (?v5 ?v6)
:precondition (and (pred_11 ?v5) (pred_12 ?v6) 
                  (pred_8 ?v5) (pred_10 ?v6))
:effect (and (pred_7 ) (pred_1 ?v6 ?v5) (not (pred_10 ?v6)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_12 obj_14 obj_27 obj_19 obj_06 obj_07 obj_01 obj_25 obj_13 obj_10 obj_24 obj_30 obj_02 obj_09 obj_28 obj_11 obj_15 obj_03 obj_23 obj_04 obj_22 obj_31 obj_21 obj_29 obj_26
    obj_16 obj_20 obj_05
    obj_08 obj_18 obj_17
    )

    (:init
       (pred_7)

       (pred_11 obj_12)
       (pred_11 obj_14)
       (pred_11 obj_27)
       (pred_11 obj_19)
       (pred_11 obj_06)
       (pred_11 obj_07)
       (pred_11 obj_01)
       (pred_11 obj_25)
       (pred_11 obj_13)
       (pred_11 obj_10)
       (pred_11 obj_24)
       (pred_11 obj_30)
       (pred_11 obj_02)
       (pred_11 obj_09)
       (pred_11 obj_28)
       (pred_11 obj_11)
       (pred_11 obj_15)
       (pred_11 obj_03)
       (pred_11 obj_23)
       (pred_11 obj_04)
       (pred_11 obj_22)
       (pred_11 obj_31)
       (pred_11 obj_21)
       (pred_11 obj_29)
       (pred_11 obj_26)
       (pred_9 obj_16)
       (pred_9 obj_20)
       (pred_9 obj_05)
       (pred_12 obj_08)
       (pred_12 obj_18)
       (pred_12 obj_17)

       (pred_2 obj_12 obj_07)
       (pred_2 obj_12 obj_14)
       (pred_2 obj_14 obj_01)
       (pred_2 obj_14 obj_27)
       (pred_2 obj_14 obj_12)
       (pred_2 obj_27 obj_25)
       (pred_2 obj_27 obj_19)
       (pred_2 obj_27 obj_14)
       (pred_2 obj_19 obj_13)
       (pred_2 obj_19 obj_06)
       (pred_2 obj_19 obj_27)
       (pred_2 obj_06 obj_10)
       (pred_2 obj_06 obj_19)
       (pred_2 obj_07 obj_24)
       (pred_2 obj_07 obj_01)
       (pred_2 obj_07 obj_12)
       (pred_2 obj_01 obj_30)
       (pred_2 obj_01 obj_25)
       (pred_2 obj_01 obj_14)
       (pred_2 obj_01 obj_07)
       (pred_2 obj_25 obj_02)
       (pred_2 obj_25 obj_13)
       (pred_2 obj_25 obj_27)
       (pred_2 obj_25 obj_01)
       (pred_2 obj_13 obj_09)
       (pred_2 obj_13 obj_10)
       (pred_2 obj_13 obj_19)
       (pred_2 obj_13 obj_25)
       (pred_2 obj_10 obj_28)
       (pred_2 obj_10 obj_06)
       (pred_2 obj_10 obj_13)
       (pred_2 obj_24 obj_11)
       (pred_2 obj_24 obj_30)
       (pred_2 obj_24 obj_07)
       (pred_2 obj_30 obj_15)
       (pred_2 obj_30 obj_02)
       (pred_2 obj_30 obj_01)
       (pred_2 obj_30 obj_24)
       (pred_2 obj_02 obj_03)
       (pred_2 obj_02 obj_09)
       (pred_2 obj_02 obj_25)
       (pred_2 obj_02 obj_30)
       (pred_2 obj_09 obj_23)
       (pred_2 obj_09 obj_28)
       (pred_2 obj_09 obj_13)
       (pred_2 obj_09 obj_02)
       (pred_2 obj_28 obj_04)
       (pred_2 obj_28 obj_10)
       (pred_2 obj_28 obj_09)
       (pred_2 obj_11 obj_22)
       (pred_2 obj_11 obj_15)
       (pred_2 obj_11 obj_24)
       (pred_2 obj_15 obj_31)
       (pred_2 obj_15 obj_03)
       (pred_2 obj_15 obj_30)
       (pred_2 obj_15 obj_11)
       (pred_2 obj_03 obj_21)
       (pred_2 obj_03 obj_23)
       (pred_2 obj_03 obj_02)
       (pred_2 obj_03 obj_15)
       (pred_2 obj_23 obj_29)
       (pred_2 obj_23 obj_04)
       (pred_2 obj_23 obj_09)
       (pred_2 obj_23 obj_03)
       (pred_2 obj_04 obj_26)
       (pred_2 obj_04 obj_28)
       (pred_2 obj_04 obj_23)
       (pred_2 obj_22 obj_31)
       (pred_2 obj_22 obj_11)
       (pred_2 obj_31 obj_21)
       (pred_2 obj_31 obj_15)
       (pred_2 obj_31 obj_22)
       (pred_2 obj_21 obj_29)
       (pred_2 obj_21 obj_03)
       (pred_2 obj_21 obj_31)
       (pred_2 obj_29 obj_26)
       (pred_2 obj_29 obj_23)
       (pred_2 obj_29 obj_21)
       (pred_2 obj_26 obj_04)
       (pred_2 obj_26 obj_29)
       (pred_3 obj_24)
       (pred_3 obj_27)
       (pred_3 obj_14)
       (pred_6  obj_24 obj_16)
       (pred_6  obj_27 obj_20)
       (pred_6  obj_14 obj_05)
       (pred_4 obj_12)
       (pred_4 obj_19)
       (pred_4 obj_06)
       (pred_4 obj_07)
       (pred_4 obj_01)
       (pred_4 obj_25)
       (pred_4 obj_13)
       (pred_4 obj_10)
       (pred_4 obj_30)
       (pred_4 obj_02)
       (pred_4 obj_09)
       (pred_4 obj_28)
       (pred_4 obj_11)
       (pred_4 obj_15)
       (pred_4 obj_03)
       (pred_4 obj_23)
       (pred_4 obj_04)
       (pred_4 obj_22)
       (pred_4 obj_31)
       (pred_4 obj_21)
       (pred_4 obj_29)
       (pred_4 obj_26)

       (pred_5  obj_08 obj_16)
       (pred_5  obj_18 obj_20)
       (pred_5  obj_17 obj_05)
       (pred_1 obj_08 obj_15)
       (pred_1 obj_18 obj_03)
       (pred_1 obj_17 obj_19)
       (pred_8 obj_31)
    )

    (:goal (and
       (pred_1 obj_08 obj_26)
    ))
(:constraints
  (always (not (pred_8 obj_23)))
)
)

; plan
1. (op_5 obj_31 obj_15)
   deleted: (pred_8 obj_31)
   added: (pred_8 obj_15)
   goals met: 0 of 1
2. (op_3 obj_15 obj_08)
   deleted: (pred_1 obj_08 obj_15) (pred_7)
   added: (pred_10 obj_08)
   goals met: 0 of 1
3. (op_5 obj_15 obj_03)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_03)
   goals met: 0 of 1
4. (op_5 obj_03 obj_21)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_21)
   goals met: 0 of 1
5. (op_5 obj_21 obj_29)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_29)
   goals met: 0 of 1
6. (op_5 obj_29 obj_26)
   deleted: (pred_8 obj_29)
   added: (pred_8 obj_26)
   goals met: 0 of 1
7. (op_4 obj_26 obj_08)
   deleted: (pred_10 obj_08)
   added: (pred_7) (pred_1 obj_08 obj_26)
   goals met: 1 of 1
